{"review_id": "LcmnQhu7dTO7MRV-_mSepg", "user_id": "ZcwLnR_VGfgLmuJ_7tnAjQ", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "No matter what time of year it is, I always enjoy hiking this trail up South Mountain. There's always something to see from the tall saguaro cacti to the desert wildlife. The last time my wife and I hiked this trail we even ran into a chuckwalla!\n\nI recommend hiking to the stone hut at the top of the telegraph pass trail, or if you're up for it, hiking all the way to Dobbins Point at the summit. Be sure to bring plenty of water and wear good hiking shoes.", "date": "2015-09-11 07:16:43"}
{"review_id": "IUrmhG6o8yI3Yn83fbEkTg", "user_id": "a7bZHb4rLMqJ04DwQIPd4g", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Great way to start the morning or end the day. I got here about 5:30am just in time to head up and watch the sun rise. Takes about 30-45mins to summit at a moderate pace (depending on how often you stop to take in the scenery, and pictures. \n\nDesert Foothills trailhead, Desert Foothills Parkway (north of Chandler Boulevard) and Seventh Street. It will be on the north side of Desert Foothills Parkway, approximately 1.5 miles west from Chandler Blvd. provides access to: Telegraph Pass trail and Desert Classic trail (see Desert Classic details).\nTelegraph Pass Trailhead is located at Desert Foothills Parkway (north of Chandler Boulevard) and Seventh Street.\nThe first  1/2 mile of this trail is a textured concrete surface for easy walking. The trail then splits off to continue on to Telegraph Pass, or on to The Desert Classic Trail.  The remaining one mile of Telegraph Pass Trail ends at the Summit Road, and offers quick access to the National Trail and the Kiwanis Trail within the park upon reaching the roadway.\nThe Desert Classic Trail continues on for about 9 miles through the foothills on the south side of South Mountain and terminates at the south ramada area in Pima Canyon.\nDistance:  1.5 miles to Telegraph Pass, the saddle in the summit road (approximately 3.5 miles up on road). \nDifficulty:  Easy to moderate - steep sections toward the top\nElevation Change:  Approximately 600 feet.", "date": "2015-05-14 16:05:39"}
{"review_id": "lCopb-gHP6eCOajD3BmsZw", "user_id": "ByNfFYaW544SRchjvAHscw", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "By this trail there is a fantastic Bed & Breakfast! There we got pampered thanks to our welcoming hosts. We took advantage of the oversized hot tub, pristine pool, lush garden, outside and inside dining. SPA services are available (facials and bodywork) and are super cheap! Meals were prepared fresh and perfectly executed by a professional chef. Breakfast and dinner menus offer lots of selections, there is even a \"Health Nut\" with smoothies, homemade bread, vegan alternatives and more. \nGreat Staycation or luxurious getaway affordable and simply out if this world!\nWe enjoyed an entire suite along with a mini gym, outdoors and complimentary refreshments and snacks. We walked from this B&B to our favorite trail every morning.\nHere is the link to the Oasis in the Desert \nhttps://abnb.me/EVmg/nA2FY7cWfI", "date": "2017-11-21 19:58:12"}
{"review_id": "rVTZwM1ifJo_v09fgeCLbA", "user_id": "3o7Rptti0q_Sxaa1a8xOYQ", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "We hiked the base trail and Telegraph pass yesterday morning.  It is a scenic, moderate path that is 2.3 miles and can be done under an hour at a regular pace.  The first .5 miles is wide and  nicely paved.  Telegraph pass winds around and climbs in elevation, sporting desert vegetation and a beautiful view when you reach the roadway at the end!", "date": "2017-01-08 22:53:39"}
{"review_id": "bFXQDNCtGauxEUmnHjSUSg", "user_id": "QGgWWhEi5R4SLAKN-xwtNQ", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 4, "funny": 0, "cool": 3, "text": "In my opinion, this is the best trailhead in the Phoenix area. Really, the number one advantage is the fact that even when busy, you can still find parking, have a great hike and enjoy a late summer afternoon. As it gets close to dusk most of this trail head is actually shaded by the mountain making it one of the most enjoyable hikes all through the summer in the area. The view is also pretty awesome from the top at Telegraph Pass looking south.", "date": "2015-09-08 06:35:11"}
{"review_id": "zPS9OdmpQt87meDcMfIP6Q", "user_id": "E4LX-6jnd-ZoZ0mwMGbWmw", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This is one of my favorite trails in Phoenix. It's easy enough to where I don't want to die at the top,  but challenging enough to make it enjoyable each time. You can't beat the view at the top.", "date": "2017-11-17 02:02:36"}
{"review_id": "_6maMRbBbQW84CVtbdjZng", "user_id": "lKPUyA6DveoWk-3zFrHA9w", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 2, "funny": 2, "cool": 2, "text": "This is a great trail that burns a decent amount of calories due to the steep part at the end, but even my three year old can do it. You get a great view on your way up too. I feel so lucky to have this in my backyard.", "date": "2017-01-23 14:25:05"}
{"review_id": "UdtgJg0uDUde9AJ6zgxaig", "user_id": "EIj7osC_bYTkv4eyHHuvNQ", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "Located a few miles away from home! \n\nQuick and easy hike from the base to the top. \n\nIt's about 1.5 miles to get to the top where the brick house is.\n\nTrail can get busy so it's better to come early in the morning.\n\nDogs are allowed. Most dogs I see are on a lease. \n\nGreat for kids who enjoy hiking as well..\nI hike Telegraph Pass trail mostly.", "date": "2017-01-01 23:03:39"}
{"review_id": "xfG6tG3lKBRgMzT31S-JDw", "user_id": "ia5kvJxYR8gPItl9O4W0Mg", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 3, "funny": 1, "cool": 2, "text": "Excellent trails and a popular one too! Start on the Telegraph Pass Trail for about 500 feet in elevation, 2.3 miles round trip. This is considered an easy hike even for your kiddos. First quarter of the mile is paved and then the rest is some rubble terrain. \n\nIf you're feeling like hiking more, then you should prepare for some water. You'll need a minimum of 50 fl oz to barely be good in the sweltering heat and no clouds in sight. And you'll want to take some salty and sweet bars, trail mix or the like. \n\nIf you continue on you can take the National Trail West and the Kiwanis Trail. This one has plenty inclines and declines that makes a round to the Telegraph Pass Trail. You can also mountain bike here too! You will easily trek about 8 miles here. \n\nAmple parking lot, a picnic table in the center and a water fountain.", "date": "2015-10-03 19:12:19"}
{"review_id": "Vs6oGhuxW2X6B7Q_CADMwg", "user_id": "6_3zElCs_9eNNJ_tdNcMWQ", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 7, "funny": 3, "cool": 8, "text": "We did Telegraph Pass trail early on a foggy, very chilly Sunday morning. Had to go through the Ahwatukee foothills neighborhoods (seeing the beautiful houses is a plus), and then came to a fairly small parking lot. It's usually a heavily trafficked trail but it seems everyone wanted to sleep in that day.\n\nIt's rated as a moderate hike on 'All Trails' and I think that's pretty accurate. The trails in this area connect to different trails, so you could honestly go as far as you'd like, or stop at the top (there's a street that is the end of this trail).\n\nWe kept walking along the road and connected to another trail to get to a peak. Overall we did just under 2 hours and covered 4.5 miles. It was a great workout, paved on the first maybe 10 minutes and then very uneven terrain. There's some areas with scary looking drop offs, so just watch your footing. Like I mentioned before,  it was pretty foggy so the view was mildly obscured but still beautiful. \n\nOn our way back down though it seems everyone was up and at 'em. The trail had become very busy with several large groups and even more small groups. There were lots of young kids too and people with their dogs. So if you want to whip your kids and dogs into shape or just take them on a good hike this is definitely an appropriate trail. (The parking lot was filled to capacity with people circling to try to snag a parking spot. My advice: if you're meeting up with a group, meet at a close by public parking lot and then carpool to the trailhead. Otherwise, go and get your hike on!", "date": "2018-02-18 13:10:22"}
{"review_id": "I5jkkIOO30-ujDQTMvw3og", "user_id": "u3rRXtoRxE5W1O19yVfslA", "business_id": "qRuKEfk4Iqzm8TIu6PuN_w", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "This is a great trailhead into South Mountain. Telegraph Pass offers a good mile or some of trail running but it can be packed at times so be aware of day and time. You can hop off to some other good trails such as National and Kiwanis. This is a good introduction to petroglyphics in the park and can be both a leisurely hike or an intense workout. I rather like the view of the valley from the army corps of engineers stone lookout.", "date": "2018-10-18 04:28:42"}
