{"review_id": "U2DCXuY8cnqEXKiDM2StVg", "user_id": "arH9TJhwjaSh8qVnJ7nmTQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 70, "funny": 35, "cool": 70, "text": "Best place to take your Car , no BS  and honest. Hard to find auto repair shop that won't rip you off. See Shlomi straight shooter.", "date": "2015-11-18 20:01:15"}
{"review_id": "PlsccX4ZGkWNbImY_UBkbw", "user_id": "fZmlBl4hVOm-A7xFJ14vAA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 68, "funny": 34, "cool": 67, "text": "I just moved here to Las Vegas and was looking for an honest place to take my car for service. Look no further! This place is both affordable and awesome. The owner tells you like it is and doesn't charge you or try to bs you into paying for what you don't need. That's important to me. I'll be bringing our other car here too!", "date": "2016-07-14 21:50:48"}
{"review_id": "UuyZlQu9Cn44BM7EEiHkjg", "user_id": "9oPadfz_B_uzCKMRZq2CHg", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 30, "funny": 29, "cool": 30, "text": "Shlomi is one of the best mechanics in Las Vegas, Honest, fare and fast. I was recommended to ABZ auto by a friend and was so satisfied with the work they did to my car. After going to several other auto repair shops in the past and experiencing poor customer service & high prices, I will definitely be returning to and recommending ABZ auto. They did not try to rip me off by adding unnecessary services or want to charge me outrageous prices. Even though I live on the east side of Las Vegas its worth the drive to get my car serviced by the best in town.", "date": "2017-07-28 21:53:34"}
{"review_id": "0URo0Dp6t1cQiBTMCwqUgQ", "user_id": "sLCVE32lUjPit-kUvlZg2w", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 83, "funny": 31, "cool": 81, "text": "I called first to find out rates. Shlomi took my call and made it easy to find out rates and times for auto repair. I needed an oil change- he didn't push me around with prices varying all over. He gave me a straight price- NO HIDDEN FEES. Other places went from $60-$100. He's waaaaaaay more reasonable. \n\nI was a bit surprised about that. So I went down there to find out- he said it would take 20 minutes for an oil change. It took 10- but after I arrived several others came and the times were longer because there were people ahead of them. I would definitely call first. Cuts down on wasting time. \n\nMy car is 14 years old so he gave me a run down on a leak and I took a look and he was right. \n\nAfter everything, the price was what he quoted me and he didn't push me around. \n\nI would definitely go back. My car is running great!", "date": "2016-03-31 22:27:59"}
{"review_id": "ITG1-seS_pi32XEJxfff3Q", "user_id": "a2cPSPOgHSSsrMtqYBjk0w", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 41, "funny": 39, "cool": 41, "text": "Went in for a smog check.  No waiting, did the work quickly.  In and out in a flash.  Recommend because they didn't make me wait for even a second.  If I need auto services will make sure and give them a try.", "date": "2017-08-08 19:10:43"}
{"review_id": "NKzbBQXO3c3LMzNoEVS10g", "user_id": "3twN5O2Ku64i5S7DjR7Faw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 95, "funny": 35, "cool": 95, "text": "I went here to get a smog and I was literally in and out. They had amazing service and I will definitely go back again! \n\nGreat customer service! Super Friendly people! Would highly recommend!", "date": "2015-11-06 21:55:52"}
{"review_id": "cRmp8j8s8UCBWu3BEp0AlQ", "user_id": "LCjnHu4gow-W3eJMf-cIJQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 47, "funny": 35, "cool": 47, "text": "Been going to this guy for awhile. Super nice, works and efficient. With a good price point as well!", "date": "2017-04-08 20:38:13"}
{"review_id": "aj0Bp3R8ELVuWT3ebMrABg", "user_id": "LPkq0OkNOvz9z0idUL51ng", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 52, "funny": 34, "cool": 52, "text": "My car was taken care of really quickly with minimal wait time. Schlomi helped me save $60 and offered me a discounted price on my next service.", "date": "2017-01-28 22:25:15"}
{"review_id": "W1NlryFjUdf7xFy28smPVQ", "user_id": "huQD0PbcJSGv4cYDuEHjBg", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 59, "funny": 33, "cool": 59, "text": "After repairing my SUV in 2 different auto shops in the area and got screwed a friend recommended me to go to ABZ. Had to do a maintenance service on my Lexus and I was totally shocked when I got the estimate! It was half the price what the dealer and another shop quoted me! They promised to return the car the next day and I got a call at the end of the same day saying my car is ready to go. I was so relieved not to go and spend over a $1,000 on a maintenance service just because it's a Lexus. Guys, highly recommended auto shop, very knowledgable staff and a quick service. They even threw a free smog to make sure that I will come back again for the next service. You earned my business. Wish there were more auto shops that be honest and fair like these guys treated me. The world will be a better place.", "date": "2016-07-06 21:00:46"}
{"review_id": "hzAZW6vdSYccNeOfKBBZhw", "user_id": "gduF785t7xecmUabPO-FzA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 56, "funny": 34, "cool": 56, "text": "I was in and out in no time. Shlomi was nice, friendly, polite, and very helpful. I just moved here so he advised me on what I will need to do to get new tags.", "date": "2016-10-28 21:15:46"}
{"review_id": "gFuI4VVA0P_xEydr1RlFLA", "user_id": "IebEwVH1B_7OeXHW4jLZrw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 66, "funny": 33, "cool": 66, "text": "Great service at a fair price. Told me what needed immediate service and what could wait. No pressure and no up selling. Happy to support a locally owned and operated business and will take my business there again.", "date": "2016-08-06 02:28:32"}
{"review_id": "I9VFFxkQqCvvqEVH4PDWMA", "user_id": "oekVwK4I_vig42bj62mHiw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 72, "funny": 34, "cool": 71, "text": "Very professional highly skilled people \nGreat workmanship  with honest and fair prices   \nWould highly recommend everyone !! \nFinally a place I feel comfortable to bring my car in and know it's in good hands !!", "date": "2016-01-06 17:13:18"}
{"review_id": "N0lpIZhuuxtwx2wwJ2XG1w", "user_id": "dqrMjcpkHa1ov7SAZVzJYA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 32, "funny": 32, "cool": 32, "text": "My car was not functioning well last week and I took a look on yelp then found this auto care. I went there and the owner was very nice to me and tell me about what is going wrong on my car. He helps a lot and giving me a nice price to fix it. He will give you good suggestion and reasonable price, not like the other auto care try to charge you more than normal.", "date": "2017-11-09 21:58:11"}
{"review_id": "psvWOz9x7XbtP7iS7F1pYA", "user_id": "qf4wJEO2aMEOVka0X3iToQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "I walked after reading good reviews on yelp..the place was totally void of any sign of customers..I thought that was strange for a Monday late morning..Anyway all needed was a service and make sure to check the tire and brakes..The owner/mechanic was intense and lacked any social skills but that's ok ..I'm at a garage so who cares but I ended up having to listen to him go over my oil change for 5 minutes and then over charge me (in my opinion)..2 stars because he didn't harm my car..", "date": "2018-01-11 23:19:21"}
{"review_id": "LG_6hhc4XpW6nQ0_f_fpMg", "user_id": "huQD0PbcJSGv4cYDuEHjBg", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 82, "funny": 33, "cool": 79, "text": "After repairing my SUV in 2 different auto shops in the area and got screwed a friend recommended me to go to ABZ. Had to do a maintenance service on my Lexus and I was totally shocked when I got the estimate! It was half the price what the dealer and another shop quoted me! They promised to return the car the next day and I got a call at the end of the same day saying my car is ready to go. I was so relieved not to go and spend over a $1,000 on a maintenance service just because it's a Lexus. Guys, highly recommended auto shop, very knowledgable staff and a quick service. They even threw a free smog to make sure that I will come back again for the next service. You earned my business. Wish there were more auto shops that be honest and fair like these guys treated me. The world will be a better place.", "date": "2015-10-20 20:39:23"}
{"review_id": "RXwWz_sMkLPmjJMyt8zY5Q", "user_id": "QoPpAJkeTuL76rZ7N4nvkA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 49, "funny": 32, "cool": 49, "text": "Came to this shop for the 1st time based on yelp reviews. And I came in here for an oil change and routine maintenance check! These guys are so professional !! Shlomi is awesome and honest! He gave me exactly what I asked for and didn't try to upsell me on anything!! Fosho I will come here again.. and do my brake service", "date": "2017-04-01 18:44:07"}
{"review_id": "z8A28s1TJDS92_uEXBjaEA", "user_id": "IY44UcM7Oz_2PekAKj8Htw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 30, "funny": 29, "cool": 30, "text": "My service was excellent. They were very professional and service was done in a timely manner. I arrived at 8 am for them to fix my air conditioner and now ii is working perfectly. I would recommend them to anyone", "date": "2017-07-01 19:27:46"}
{"review_id": "ymf12wbHpQWziI33nlyHgQ", "user_id": "kjaOZDNoChu6nUsVJ9ATBg", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 27, "funny": 27, "cool": 27, "text": "They did a DMV inspection for me on my truck. With other places it was a song and dance to get them to do it. They did an inspection and were very familiar in filling out my paperwork and what was needed. They are very knowledgeable as well.", "date": "2017-12-07 18:38:39"}
{"review_id": "qNppDaZRZNvjofeO-0HfYg", "user_id": "7cn5DQNDKU2xutZj9MVLQA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 75, "funny": 35, "cool": 75, "text": "I had a substantial gas leak on my Toyota Avalon that left a big puddle on my driveway, as pointed out by my neighbor.  I remembered a friend had recently told me how conscientious and skilled ABZ Auto was, and I needed an honest repair company, as we all do. Taking my car there was the best thing I ever did!  Shlomi's attention to this problem went way beyond my expectations.  ABZ Auto Care is the best example of a customer-oriented business that I have ever experienced.  The origin of the leak was not initially obvious, because the car had not leaked overnight when I left it there, and there was no immediate sign of where it had leaked from when they looked underneath the car.  Shlomi kept digging, including driving the car around to see if that would start the leak again.  It did not.  Through his diligent efforts he realize gas had gone where it shouldn't have as a result of my overfilling it at the gas station!   They went to work and cleaned the vacuum hoses, etc., and even drove my car again to assure themselves it was fully repaired, that no engine light came on, etc. They fully explained how the problem happened, how they did the repair, and what I needed to do as the owner to prevent a reoccurrence.  They were skilled, motivated, kind and patient.  Their prices are very fair.  I fully recommend ABZ Auto Care to my family, friends, and all who seek out a business with integrity and honesty.  I can't say enough.  Thank you!", "date": "2016-05-10 17:12:50"}
{"review_id": "6br0RqbdVlZ6mMBa3gDeVQ", "user_id": "2bgZ4UZltvC64wMTpqZj6w", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 78, "funny": 33, "cool": 77, "text": "I keep returning to ABZ, every time I need something done to any of my cars. They're extremely honest, and the repairs they do are high quality.", "date": "2016-04-11 00:02:19"}
{"review_id": "VsZf1UZJ43Q0zaTctHgxQA", "user_id": "GpsjLYLGzfqz5KWNlBo2Sw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 1.0, "useful": 2, "funny": 0, "cool": 0, "text": "Called to schedule a brake inspection and spoke to a guy that was incredibly rude over the phone. Tried to get some information regarding their available appointments for the day and couldn't stand his condescending tone. 1 star for customer service skills. Lots of other shops out there that treat their customers with respect. I'll take my business elsewhere.", "date": "2017-07-01 16:05:12"}
{"review_id": "y0BJkjv1Oo35kGmonbXRCA", "user_id": "W-z_i4YEwVr63SOYPE7Tkw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 92, "funny": 31, "cool": 89, "text": "Super fast and friendly. Got my car smogged in minutes for much less than I had previously paid at \"whiffy pog\". Thanks to the guys for getting me done in record time on a Saturday morning!", "date": "2015-12-12 22:59:55"}
{"review_id": "ikmwT3hM2vGSP208LbglbQ", "user_id": "arH9TJhwjaSh8qVnJ7nmTQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 90, "funny": 33, "cool": 90, "text": "Brought my son's car bad leak other shop said head gasket,well ended up being a hose. These guy's are honest. I recommend this place for all your automotive needs.", "date": "2016-01-09 20:36:33"}
{"review_id": "-HC_sIq0-cRvZC86enL4FA", "user_id": "AMdGLT8LlCeHcTFISfXQMA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 42, "funny": 35, "cool": 42, "text": "We came into ABZ Auto Care based on other yelp reviews. The air conditioning in our car was not working properly, and Shlomi was able to diagnose the problem and get it fixed all within the same day! We appreciated the fact that he wanted to make sure that he not only fixed the problem, but fixed it right. We are confident that our AC will be in tip top shape! After picking up our car, Shlomi even checked in to make sure everything was working properly. We are so appreciative of an honest and reliable mechanic here in Las Vegas. We will be back to ABZ in the future for any of our maintenance needs. Thanks again, Shlomi!", "date": "2017-06-21 22:45:30"}
{"review_id": "pDpOdez8sgGPwm3ZjcqjqQ", "user_id": "pxgXeLbmTZMtcXeSceLI3w", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 21, "funny": 20, "cool": 21, "text": "I had a wonderful experience at this shop! Being a girl, I find it hard to trust mechanics. Shlomi really made me feel better about dealing with mechanics and he fixed my car too so double win for me! I will always go to ABZ Auto Care for all my future car issues.", "date": "2017-08-03 02:22:23"}
{"review_id": "dq7YFLtMz5cclkrhSt84iw", "user_id": "pxgXeLbmTZMtcXeSceLI3w", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 21, "funny": 21, "cool": 21, "text": "Just visited Shlomi for a smog check and he took such great care of me! He even found something hat could have caused a really big problem and fixed that as well! Thanks Shlomi!", "date": "2017-09-16 00:02:49"}
{"review_id": "aE2kx0yxYi5g0L6yX7jCYw", "user_id": "1EcF4Ck__ByWc05bYOD2KA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 50, "funny": 36, "cool": 50, "text": "After reading the reviews I decided to give this place a try and get my oil changed with them. Great customer service! Shlomi is awesome, makes you feel like a regular! The process was quick and the price was reasonable! I'll definitely be back :)", "date": "2017-02-24 21:07:14"}
{"review_id": "G7WEz2hAMKAgD1pIiSjbRw", "user_id": "kmhGLUyByh_apgVTFulC2g", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 42, "funny": 39, "cool": 42, "text": "I love this place. As a woman I hate going to auto repair places cause I feel like they will take advantage of me. These guys make me feel like I'm family. I've had them do work on my car and my daughters car. They are very reasonable compared to other places and honest. Thanks for all your help your the best. We will be back whenever we need our cars fixed or serviced.", "date": "2017-07-24 18:33:34"}
{"review_id": "SESQ9CoDYCFp5p3A900e9g", "user_id": "yKD1x_Nyrg1kf6MlW0z8Ug", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 94, "funny": 32, "cool": 94, "text": "Needed an oil change- was super fast super price and great customer service! So thrilled to find this place and its SOO close to where I live -I used to drive across town for a decent auto shop. Shlomi checked my tires and all the lights / alerts in cars computer and reset them all. He had great insight in another problem I've been having and recommended I come back and he'd check it out- he'd have checked right away but I was in a hurray and needed to bolt. Great service! I'll be back!!!", "date": "2015-11-29 08:20:29"}
{"review_id": "4q4yZ3Ox2CJ4w3rjmafqUQ", "user_id": "CE2vXTZ4n07O33n47a_BvA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 45, "funny": 34, "cool": 45, "text": "I was looking for a place to fix my car and I came across this one on yelp so I thought I'd try it out. I was a little skeptical at first but they took good care of my car and would come back again for both repairs and regular maintenance. They did great work at a very reasonable price.", "date": "2017-05-07 18:39:52"}
{"review_id": "ceh8ilkIYtNtqFxx6rTNvw", "user_id": "GL3_c2BErBmBlx6j65iARQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "BEWARE, SCAMMERS. Never been to this place, but saw that it had decent reviews, so I took my 2017 Hyundai Tucson in, looking to get an oil change and tire rotation. Got there a little around 8, but tech hasn't show up yet, so killed an hour and came back. Once tech was there, they tried to give me an estimate of $145!!! Like what?? Then when I tried to leave, they told me if I wanted to just pay in cash, no receipt, they can knock down the price to $120? WOW...stay away folks.", "date": "2018-03-08 18:36:53"}
{"review_id": "ncY8SnZYdh7JQJ63S69-5A", "user_id": "ODlMhpys5mvId-lbd6WugA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 47, "funny": 42, "cool": 47, "text": "Went in there for a quick smog. Quick was the word. Out in ten minutes and paid. Been looking for a new mechanic. I think I just found him", "date": "2017-04-26 18:56:12"}
{"review_id": "Ti4vE7fONedFWrEVuZwVEQ", "user_id": "tL8fgYfFqDQ0URNRQTB3Tw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 48, "funny": 46, "cool": 47, "text": "I've been bringing my '04 Accord EX here for years. Shlomi is the best. Very honest place. Have never been pressured into anything I didn't need. Have had my brakes done and multiple oil changes. Had a dead battery late on a Friday night and he was there to take care of me when i was in a rush. He will also beat any estimate in town. Highly recommend. 5 Stars all the way. It also appears because I don't have many reviews on Yelp, my review goes unseen and moved to the bottom for some reason. But this place should be HIGHLY RECOMMENDED!!", "date": "2017-04-05 18:06:38"}
{"review_id": "L-qSIwnTO5S6QJV4U8MieA", "user_id": "_6exGHmP0rEat6o2CC6P3g", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 30, "funny": 30, "cool": 29, "text": "This is the best auto repair shop I have ever been to. They were honest and didn't try to rip me off. They were very professional and personable.", "date": "2017-07-25 04:34:20"}
{"review_id": "4sI0L3-EzflmW7r5ABk6mA", "user_id": "Knm3apGGb7uNhLhkOsG8Uw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 28, "funny": 27, "cool": 28, "text": "Amazing service. Completely friendly. Makes the car that you need fixed top priority and gives you honest answers and gets you the best prices and fixes. Thanks ABZ Auto Care. 5/5", "date": "2017-07-24 19:16:06"}
{"review_id": "ipBN60_hppYLrP2cV1R43A", "user_id": "ptNvCWyqtXxQISBJdLEt4A", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 84, "funny": 33, "cool": 84, "text": "I have found my new mechanic!!! I highly recommend Shlomi and his team here at A B-Z Auto.  I dropped my car off  at 8:15 with a failed SMOG and a check engine light on. Shlomi took me right in and he was done by 1:30! He went above and beyond to take care of me AND sent me on my way with my passing Smog ! And then called me the next day to ask how my car was running.  Thank you for the excellent service!  Oh! And did I mention how nice and clean the waiting area is?! WOW!!!! I will send all I know to A B-Z Auto! !!", "date": "2016-03-15 18:29:11"}
{"review_id": "ks2otMBs8EBkpAG2A866eQ", "user_id": "JfFNQPVVmyQTBb320l8jLQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 89, "funny": 37, "cool": 93, "text": "Simply Awesome! \n\nReliable, Affordable, Quick, Trustworthy! Everything anyone can ask for in a mechanic!!", "date": "2015-05-21 22:10:52"}
{"review_id": "cU5sgz9ZYuB3Dld-YXajPw", "user_id": "PrVV5XFfbrkZCBD_Hj2SDA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "This is the first time I've been let down by Yelp reviews. \n\nMy experience here was a complete and utter disaster. From the looks of the photos on this page, it appears as if I was dealing with the owner, who seemed unnecessarily agitated from the moment I walked into his business. After nearly 20 minutes of borderline-ludicrous hostility, I called him out on his behavior, asking if he had a personal problem with me for some inexplicable reason, to which I was met with a \"friendlier\" form of condescension. It was all downhill from there, and I completely regret my decision to stick around and let him work on my vehicle.\n\nThe guy may be great at fixing cars, but he needs a hell of an improvement in his customer service skills; Isn't that half the battle of running a business? Hell, being a half decent person shouldn't be a lot to ask for, should it?", "date": "2017-07-23 23:47:46"}
{"review_id": "AKZJROYq9l4fFYGQRencJQ", "user_id": "jATnB_mVxI0_Dxa8IjrxJA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 98, "funny": 37, "cool": 107, "text": "Shlomi Bega,  owner is awesome!  Fantastic place, fair price, honest owner and workers. I highly recommend this place to anyone who needs any type of repairs to the vehicles. Couldn't have been blessed more.", "date": "2015-05-08 16:45:34"}
{"review_id": "cVQsqHFMw40MDuEJEmSNXg", "user_id": "7uWE7YWlRrde5fifL9KTuQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 97, "funny": 35, "cool": 94, "text": "Thank you Shlomi.  Was told I needed a new catalytic converter from two other shops.  Estimates ranged from $2400 to $2900.  Shlomi told me up front that it was a $250 sensor.  Fixed my car.  Honest mechanics are hard to come by.  Thanks again.", "date": "2015-10-16 17:43:44"}
{"review_id": "7lbM4IXQwB8cZLEDXHW2kA", "user_id": "fAZMvmiZ5TrqztCHL9B9YA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 56, "funny": 48, "cool": 56, "text": "What a relief! I finally found ABZ after an aggravating search for the right garage. I discovered ABZ after going with a friend of mine to an appointment with Shlomi, which revealed to be a big job. I observed his honesty, generosity and fulfillment of promises through this experience and once it came to be my turn in a water pump situation, I immediately pulled up to his garage for help. Shlomi is straight forward, to the point, extremely knowledgeable and fair. Whenever I have an issue I can count on him to tell me how it happened and what options I have (or don't have, depending on what I've done on the account of how I prefer to drive). Not only does he get the job done well and in a timely manner, but he calls to check up on the car afterwards. Even if it's a small, general question, I can call him up at the shop and he'll make sure I fully understand any inquiry I may have.\n\nIf you're going around looking for estimates from dealerships or mechanics with fake grins on their faces and feigned concern in their voices, then you're doing it wrong. Shlomi has nothing to hide and he'll make it known to you by his frankness and actions. If you decide to go for the bs of others, you'll be back at Shlomi's ABZ asking yourself why you didn't do it in the first place. Save yourself the time and money of scams and do yourself a favor - GO TO ABZ AND FIND YOUR SOLUTION!", "date": "2017-02-05 21:17:42"}
{"review_id": "LT6GKPiz-MxiMXzl0tE2HQ", "user_id": "cFGAElozHTdQDfHimOiSBQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 69, "funny": 36, "cool": 68, "text": "As a Pet Sitter, I depend on my car and I also have very little personal time so I usually wait until the last minute to do important things and today I sure did. \n\nI had a break between clients and knew it was now or never to get my brakes fixed. Messaged every business on Yelp, called my family members and finally took my car to ABZ because my gut just said - go there. \n\nThe owner was very concerning, honest and outgoing. He gave me a written estimate and offered to fix it right away and took my personal concern about having to be at work by 530 to heart and was able to get me in at 3pm and out by 5pm exactly. \n\nHe showed me the brakes afterwards (I should have asked to see them before but I was in a hurry and after seeing them yeah I was pushing it) and he went over everything with me. \n\nIt can be hard owning a car and being a girl, men like to screw us \"blondes\" over but he was so honest, upfront and presented himself as someone who cared about his work because you work to pay your bills and not just making money to be rich. \n\nMy brakes feel so much better which is a great feeling considering how people drive in this town, just yesterday i was almost in 3 accidents alone because of bad drivers and that was risky with my brakes....\n\nHappy to find a place in this community that cares and isn't a \"corporation\", ABZ is family owned and they've been doing this for years! It was a little bit more than what I wanted to spend but at least I know the job is done and I can drive in peace.", "date": "2016-08-24 01:09:32"}
{"review_id": "PO9arbgEjQZ6US4xdtnYXw", "user_id": "IY44UcM7Oz_2PekAKj8Htw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 31, "funny": 31, "cool": 31, "text": "ABZ Auto Care is my favorite place to take my car. They are honest and reliable. They always let you know the cost upfront. The owner is professional and cares about his customers. I would recommend this business to anyone.", "date": "2017-11-04 16:02:07"}
{"review_id": "rHuKtiin84-jqvtv9MdBCQ", "user_id": "oa8K9ZcUH_Ze8Ku39q0SRw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 53, "funny": 36, "cool": 52, "text": "Wasn't initially impressed with costumer service but the clerk seemed to be having issues with his computer so I gave him the benefit of the doubt. I got an oil change and inquired about a synthetic blend oil for my 2016 accent and he told me that synthetic is expensive and unnecessary for my model car. I appreciated his honesty. He told me that as long as I changed it every 3000 miles that my car will be in great condition. He was also very upfront with the price, 35$. I would much rather support a family business and a good one at that then go with corporate owned auto shops. I will definitely be back in the future! I timed the oil change and it took them 15 minutes. 5 stars all around!", "date": "2017-01-23 17:55:55"}
{"review_id": "WuXaexO5akd_dSSSzDX0mg", "user_id": "l5H7ZryTeqSidjKXM9RpSQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 31, "funny": 31, "cool": 31, "text": "ABZ Auto is my go to mechanic here in Las Vegas.  Both my girlfriend and I bring our cars here whenever we need work done.  The owner (Shlomi) is very knowledgeable, honest, and fair.  I highly recommend this auto shop to anyone looking for a great auto mechanic.  Keep up the good work Shlomi!!", "date": "2017-12-02 01:02:22"}
{"review_id": "oMJ6m-SdTviy1fV4oc9ggw", "user_id": "a1Ho93XLAhAoqMDn8-vyxQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 67, "funny": 33, "cool": 67, "text": "I can't believe what an amazing experience I had with you guys. Shlomi did such an amazing job and is such a kind hearted person! I'm definitely going to come back for any car issues I have in the future and will recommend you guys...", "date": "2016-07-03 00:05:53"}
{"review_id": "Y-zuBm1lULqRLPOT79fqSQ", "user_id": "k5mSQTw8ongDSKEEUiK94Q", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 20, "funny": 20, "cool": 20, "text": "I called regarding an inspection of a pre used car, got great tips which saved me around 6K. \nGreat service, great people, just great - highly recommended", "date": "2018-02-10 17:46:32"}
{"review_id": "X0gKoQuOy3Bga8sjCFRIsA", "user_id": "d7URo_srMmROIODPeiIBgw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 88, "funny": 32, "cool": 88, "text": "Super fast service. I walked in and they were working on my car within 3 minutes! Very friendly staff and definitely the more inexpensive auto shop in Vegas. I will surely be coming back the next time I need auto service!", "date": "2016-01-25 23:04:42"}
{"review_id": "kHAM8N1pfbtqm_Ns5lu5Ig", "user_id": "5V4bdH2oa35NBHf-18TGag", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 82, "funny": 34, "cool": 81, "text": "I have a 2001 Lexus LX470 and I bought it in 2004 at 30K miles and now it has 127K miles.  I love the truck to death and do change oil every 5K miles, change tires when they are smooth, change brakes when they are worn out, change batteries when they no longer hold a charge, and change wiper blades when they cannot wipe the windshield clean.  Other than that, I wrongly believed the truck needed no additional maintenance due to its world renowned reputation for reliability.....  Boy was I wrong!\n\nA few weeks back I took the truck out from my house and it was shaking like a leaf and the Check Engine light came on.  I had enough good sense not to drive it and carefully navigated back home immediately.  Since this is no longer a regular maintenance issue, I know I would be rimmed royally if I just tow it into any service shop.  Since I came from LA 3 years ago and really don't know any reliable local repair shops, I texted my buddies for recommendation and they told me to find out what the error codes mean first by scanning the computer.  I proceeded to purchase a scanner on eBay and waited for its arrival.  I scanned the computer successfully but all it said was \"multiple cylinder misfiring\".  This sounded serious as I did not anticipate engine trouble...\n\nI YELPed and found several repair shops around me but most of them have very mixed reviews.  If you are a local, you probably have experienced the same.  Anyway, I found a listing for A B-Z and all of the reviews are 5 stars.  I went through each review and they seemed bona fide so I decided to take a leap of faith and tow the truck to A B-Z and see what they can do....\n\nShlomi found one of the spark plugs jumped out of the hole it was supposed to be in and that's why it was running real rough.  To fix this problem was a whole lot more involved than just screwing it back in, though.  He had to re-thread the hole so the new plug would go in and replace everything I was supposed to replace all through the years as regular maintenance would have demanded.  So, I paid A LOT OF MONEY this trip but it was my fault.  Shlomi repaired the truck, replaced the timing belt, replaced the front brakes, cleaned fuel injection, and cleaned throttle bodies so the truck is running much better than it had been for quite a while.  He showed me all the parts he replaced and assured me all parts he used were OEM and not some cheap knock offs.  Bottom line is I spent a lot more money than I had anticipated in spending for this experience but it was all due to deferred maintenance on my part.\n\nBTW, he also looked at my 2012 Toyota Prius V another shop was chasing after me to replace the rear shocks due to \"leaks\".  Shlomi found the shocks fine and not leaking so I escaped from this $400 con.  Shlomi even called me the day after I picked up the truck to make sure I was satisfied with the repairs.  Who does that nowadays??  Anyway, Shlomi may be a bit rough around the edges but I believe he is an honest and good mechanic which is really hard to find in this town.  Go ahead and have him give you a 2nd opinion on your car trouble and you just may end up becoming a customer for life!\n\nJust to clarify.  I am a REAL customer and was not paid or given any incentive for this review.  As a matter of fact, I paid A LOT OF MONEY to them for the services received but I believe it was a fair and square deal.  DEFINITELY NOT THE CHEAPEST, but probably the best service I could have gotten for the money and the truck will last a lot longer because of the services received.  If you care about your car and really want to take care of it, then I believe you owe it to yourself to give A B-Z a shot.", "date": "2016-04-08 18:49:49"}
{"review_id": "jLCccpOvhkX1rvLO0GjSsg", "user_id": "rPGnKucLyBmGtRJSqsa9Rg", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 21, "funny": 20, "cool": 20, "text": "Great honest business owner, the owner is very genuine and told me the previous person who did my oil change did them wrong by not screwing it tightly, he fixed the botched job from the previous place and gave me a great deal. I'm only coming here from now on for my car needs.", "date": "2018-02-28 21:15:14"}
{"review_id": "2JiIv_wezKg4kSd_1DJNjg", "user_id": "Y8EYu9HuHMUoJ8YBvL4Ebg", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 10, "funny": 10, "cool": 10, "text": "I went to ABZ Auto Care to do my breaks service and felt like I was in good professional hands. Shlomi explained the process and did a great job using quality materials. I was out in less then 2 hours and most important the price was fare. \nThank you all at ABZ Auto, I'll be back for my smog test!", "date": "2018-03-17 02:48:56"}
{"review_id": "Ex41x1adnU-mWJICjq4Qxw", "user_id": "RZ1Fq9AuQ0OkRdTzpr1NvA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 33, "funny": 31, "cool": 32, "text": "I only know of a few honest mechanics and this is one of them. He not only did what i asked him to do but he went above and beyond. \n\nListening to him talk to other clients, he gave them solid advice. Offered them all their options and let the customer pick what would be best for them.  How many people do that? They usually say do this and costs xx. \n\nThis guy cares about doing what is right for everyone.  Ill be back!", "date": "2017-12-19 00:11:47"}
{"review_id": "xbVWu07d60Gm9gBkQhF7ng", "user_id": "k5mSQTw8ongDSKEEUiK94Q", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 21, "funny": 21, "cool": 22, "text": "So following ABZ's tip, I did not buy a BMW X5 and went with a Lexus RX 350. Before buying the car, I took it to ABZ for inspection, the guys there were really helpful and provided an elaborated sheet of the car condition, it did not cost a lot too :)", "date": "2018-02-16 22:40:45"}
{"review_id": "I797rGw1aMmSmA0QYKLURg", "user_id": "CQq8tizFAfnxsYbeieaiNQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 14, "funny": 14, "cool": 14, "text": "Shlomi is the best, he did front and back brakes on my suv. Got rid of my noise and did a great job. I recommend him to everyone and will be back for any other services including smog", "date": "2018-04-03 23:27:07"}
{"review_id": "OrK6qi5yz79uMC93WO9iRw", "user_id": "LGEBsfPVURULXZvGSQkTLA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 18, "funny": 18, "cool": 19, "text": "Nice guy from Chicago who doesn't BS with you.\nAwesome service and always takes care of my car.\nThank you, Shlomi.", "date": "2018-04-13 22:25:48"}
{"review_id": "FrGk0Db66IXxsuELrO-eBA", "user_id": "zg5NnLO_Y46RrnHINI33qA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 71, "funny": 38, "cool": 71, "text": "Found this location due to the 5 star reviews on Yelp. Shlomi and his team live up to the hype. I was a walk-in with issues with my 2011 Mercury Mariner (suspension bearing and spark plugs). Received a quote and had the work done immediately. I got my truck back the very next day. Shlomi is extremely knowledgeable and honest. He showed my husband everything that he fixed showing the old parts that were replaced. Finding an honest mechanic proves to be difficult but you will not have to worry with Shlomi and ABZ. He takes pride in his work and will get the job done right.", "date": "2016-06-08 00:51:04"}
{"review_id": "S_zk2PsTWnPBd7hFr1S-ug", "user_id": "5RxyJWavdRrUd3nju4Aa5Q", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 45, "funny": 43, "cool": 46, "text": "Great and fast service. Took an extra look at my car to make sure it's running great. Thank you Shlomi", "date": "2017-08-05 20:41:30"}
{"review_id": "NZTA4MjG6xey7K_76bGuYQ", "user_id": "bar-kip6swYjO3qHxBsekg", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 18, "funny": 18, "cool": 18, "text": "They fixed the brakes, door and noise problem in our van and they did a very excellent job. The car parts they used is top of the line and quality of job is very good!!! I would highly recommend it!!", "date": "2018-02-22 22:55:36"}
{"review_id": "0ErRdnEpH9NolMH56RG1FQ", "user_id": "IdGt5n3oUA6-SBRfTPCLJg", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 40, "funny": 39, "cool": 41, "text": "Since they opened, this is the only place I go for all my car services.   Tires, oil, smog,repairs...\nThe owner is always there and he knows what he is doing.   Unlike other places in Las Vegas, they will never lie to you and always be honest.    It's a nice family business and great service.", "date": "2017-09-01 16:06:28"}
{"review_id": "CwYChe7IiAeiM91-rGAltg", "user_id": "4tBboKZrkVWp4IZES_wqug", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 75, "funny": 33, "cool": 76, "text": "Took my 2002 Jeep Wrangler there for issues I had related to passing smog and a check engine light.  From the time Shlomi took my initial call until my service was complete, everything went smooth.  Shlomi is honest man, easy to talk to and very knowledgeable. \n\nI recommend him highly!", "date": "2016-05-17 01:26:39"}
{"review_id": "sa07oO7DaD9p2wID931BNw", "user_id": "Y43NSj8oGg8HFGX-ulV94A", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 17, "funny": 17, "cool": 17, "text": "I started bringing my car here 2 years ago because of the great reviews and have not been disappointed.  I highly recommend Shlomi and his business for his excellent service and honest prices.  He has done everything from oil changes to replacing worn out shocks on my 10 year old auto. My car is running better than ever now.", "date": "2018-03-14 02:12:16"}
{"review_id": "bK3085OiCFZftw_YgrYcsQ", "user_id": "zTb_qo29YUs0wHWtqIeBRA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 39, "funny": 37, "cool": 39, "text": "Great customer service! Took care of my vehicle in quoted time. Helped fix my brakes at a affordable price. I will be back.", "date": "2017-08-04 20:03:08"}
{"review_id": "ywg3aeKlPnALKxD0UVpc_Q", "user_id": "OOUECxoKBIsP1DvKaraz3g", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 43, "funny": 43, "cool": 43, "text": "I'm new to the area and came here recently because my car started making an awful noise. I chose ABZ based on reviews from Yelp. The first thing we did is drive it down the road together so I could identify the noise to him. He knew right away that it was most likely the front wheel bearings.\n\nHe took the car in to look it over, gave me a call a couple hours later to let me know all the issues and a quote. He had it all done early the next day. This was an easy, comfortable, and extremely positive experience! After getting the car back, he called me to check up on it and make sure I was still satisfied. I felt like I was given VIP service and he put all my car worries to rest. I am definitely a customer for life now. Any time I need car work done, I'm going to ABZ.", "date": "2017-08-11 18:17:08"}
{"review_id": "Umt_rvjoCyw4bahyP1bk-Q", "user_id": "y4xTVDkpGMafrDr_jUj8Bw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 99, "funny": 30, "cool": 109, "text": "Really REALLY impressed!\nQuick, efficient, reliable, really nice guys and a fraction of what I had been quoted elsewhere.\nThanks a lot, i'll be back!\nRichard", "date": "2015-03-30 20:44:21"}
{"review_id": "AJpfm4Yxdm88DYjF0vkfYg", "user_id": "dFloDJo3z4RPD_M88hS-_Q", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 14, "funny": 14, "cool": 15, "text": "ABZ, is one of the best, honest car repair place you'll ever go to. I reached out to ABZ and scheduled an appointment for A Saturday afternoon. I needed to replace front brakes and rotors for a Dodge Grand Caravan and their service was amazing! The price was far less than the dealerships. \n\nAlso, they checked my rear brakes and rotors with the conclusion that they're in great shape and no need to replace them. I'm sure the dealership would have tried to upsell unnecessary work, but not ABZ.\nHighly recommend ABZ for any car repair. I'll definitely be back.", "date": "2018-04-16 00:59:43"}
{"review_id": "SgLZKX58Qu29_GJl5GIgeQ", "user_id": "drbvITFpYjRyHRGo5LcUBQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 27, "funny": 26, "cool": 26, "text": "Had a problem with my turn signal and Shlomi was able to take a look at it first thing when I brought it in in the morning. Great and honest service! Very friendly and will be coming back!", "date": "2018-01-20 16:34:36"}
{"review_id": "nMgGRZ0leDgFo6lEYe-A_w", "user_id": "e3bSgYOkM3fr_um_Vajxaw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 19, "funny": 20, "cool": 20, "text": "Wonderful place! Shlomi was able to help get my car trunk open and offered follow up repairs if necessary! I truly appreciated his time and professionalism. The shop is immaculate and I definitely would recommend to anyone who needs help with their car! Thanks again.", "date": "2018-03-17 21:54:49"}
{"review_id": "vKdg8gI-T56DLQUrk4HKgQ", "user_id": "PiDPwcqd01Wt07dEQIG1kg", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 19, "funny": 19, "cool": 20, "text": "Shlomi is friendly, professional, funny and honest. Needed a quick oil change and he took care of me and my car in the most efficient way. Highly recommend!", "date": "2018-03-17 19:40:11"}
{"review_id": "CfFgczN330m8GXf2bc1RXQ", "user_id": "X7PcaBgAvF3XAj64GirioQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 23, "funny": 21, "cool": 22, "text": "Always great service. Honest and fair priced. I have had several oil changes and they are quick and do QUALITY work. They also did my brakes and rotors and did a fantastic job. This is a great place to have your vehicle worked on.", "date": "2018-02-16 23:21:26"}
{"review_id": "DD5NIksFqNzRyeDWuJwAuA", "user_id": "7uWE7YWlRrde5fifL9KTuQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 20, "funny": 19, "cool": 20, "text": "Getting my oil changed. Best in the business!!!\nThank you for letting me know I had the wrong oil filter replaced by the last shop. These guys are all about getting in and getting it done right and getting out.", "date": "2018-03-29 19:22:00"}
{"review_id": "txP3mjtI-vdPNrEF0bo9iQ", "user_id": "HaeZaAWN8GsIL55Ya-irSw", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 36, "funny": 36, "cool": 37, "text": "This is the only place I go to get my oil change for my Toyota Rav4. The staff is always helpful  there when I need them. They go way beyond my expectations and having a honest mechanic goes a long way. \nThank you for such great service!", "date": "2017-09-27 21:53:34"}
{"review_id": "k3yZJUPu8u_pNvNmblFKvw", "user_id": "0ERzoDdzpfhS1Xz_BSjmDQ", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 51, "funny": 49, "cool": 51, "text": "Shlomi is the best!!! I cannot thank him enough for fixing my car!!!! \n\nMy car started to overheat when I was driving into Las Vegas from Utah and he helped me fix it right away. I brought it in, explained my car troubles and he fixed it for me that same day knowing that I had to drive back home that next evening. He definitely knows what he's doing and truly takes care of his customers! I even got a follow up call the next day once I had already gotten back home to Utah bc he wanted to see if we made it home okay! \n\nSo glad I went with him!!!!", "date": "2017-05-16 18:48:31"}
{"review_id": "wIPhRl5CUbcu_xwgWKnIuQ", "user_id": "0pnITZyMrKR80ZjNjYzl3A", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 79, "funny": 34, "cool": 79, "text": "Had new front brakes installed about 6 months ago and kept getting shuttering at high speeds. Brought my van back 2 times and they could not diagnose the issue. Took my van into ABZ and had it fixed in 2 hours. Customer service was amazing and informative. Will be referring and coming back for sure.", "date": "2016-04-15 01:34:07"}
{"review_id": "-MGPourcw4NdAEhD3aauFg", "user_id": "PFGKh12660u0AesoQwNTbA", "business_id": "M82c96ICluambjx0wWg6Bg", "stars": 5.0, "useful": 68, "funny": 37, "cool": 68, "text": "The is definitely one of the best auto shop I have been to in Las Vegas. Living here for over 15 years, I was constantly moving from mechanic to mechanic trying to find I trust. The owner Shlomi is so honest, you wouldn't believe. Another shop in the area told me that I have to replace a sort because my engine light was on and it's going to cost $450. I decided to go get another quote at ABZ and he told that the wires we just cut, and there isn't even any damage, and didn't charge me a penny! This is a true honest and real mechanic shop that I will trust forever now.", "date": "2016-07-03 07:44:42"}
