{"review_id": "4QgWPT6MuA5UHtXYG2p7ww", "user_id": "WxXB_DB_Im9mb00M8balAg", "business_id": "U_ihDw5JhfmSKBUUkpEQqw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wonderful staff,  great wheelchair accessible location,  good wifi,  no power outlets.", "date": "2014-07-14 06:18:14"}
{"review_id": "H2r2WT8nFmEIy4KDwEhjOg", "user_id": "bJTKxBIvb_AR8d4SuLPV8g", "business_id": "U_ihDw5JhfmSKBUUkpEQqw", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "this is closest one to home, it's a Walmart mcds so it not that big but it has enough seating.  the staff is nice,  seem to be the same people for the longest time so it good to see some constant things, the place has just got under renovation so it a mccafe location now, seating seem to stay about the same", "date": "2015-03-23 16:28:39"}
{"review_id": "D1vkMJFWHiG7jv9LSDDSpg", "user_id": "uhdozpRP_uk303jvIv10nQ", "business_id": "U_ihDw5JhfmSKBUUkpEQqw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is dirty , And the people is making the line between the tables wen you eating.", "date": "2018-07-11 01:05:15"}
{"review_id": "kNceyFrwV5ZjlQ_RlMFy1Q", "user_id": "-9SoHrhiiUVmx6-MkyR4RA", "business_id": "U_ihDw5JhfmSKBUUkpEQqw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is inside Walmart, and since there are no seats anywhere near Walmart it is always packed.\nLast week we tried to get Gingerfrost Milkshakes, but the ice cream machine was broken.\nWe returned this weekend, and ordered the same thing, it was nasty, the person making them had no idea how to, the shake tasted mostly like vanilla, but there were tastes of strawberry, chocolate (pretty much any leftovers they had).\nCertainly not like the Gingerfrost shake we had at another McDonalds.\n\nIf you can find a seat, it's a decent place for a coffee.", "date": "2012-11-17 21:57:49"}
{"review_id": "t6JsEviFJfpmSWcgXb5t6Q", "user_id": "aLvxbF2DueKFOqul9eVWCw", "business_id": "U_ihDw5JhfmSKBUUkpEQqw", "stars": 2.0, "useful": 1, "funny": 1, "cool": 1, "text": "Ok, it's McDonald's, but I'm an equal opportunity Lobster Roll lover - so when I heard that McD's introduced one, I had to try it.\n\nAs with most McD's products, the pictures in the advertisements look FAR more enticing than the real thing. The McLobster was much smaller then the pictures suggest, didn't have much meat in it, and was a bit soggy. They use the same pre-packaged iceberg lettuce that they use for the McChicken, and a plain hot-dog type bun, rather than a roll. \n\nNot sure why I was expecting more, but for $12, I actually expected at least a little more.\n\nIn terms of the place itself, this location is located inside of a Walmart, so they try to shoo you out a bit before store-closing. There's usually long lines here, but plenty of seating while you take a break from your shopping.", "date": "2015-07-09 05:49:30"}
{"review_id": "F0w5buDwTwzBXs1axgLe-w", "user_id": "yeX7tzZZWCnphQifRJglUg", "business_id": "LixFCMGKdptI8WRsjAl5cQ", "stars": 1.0, "useful": 1, "funny": 1, "cool": 0, "text": "This branch is a bit substandard compared to other McDonald I have been to. \n\nMy colleague ordered the salad and from where I was sitting the lettuce looked piss poor I'm quality. At least the salad dressing was pretty. Ice. \n\nAs for our burgers it seemed to be assembled haphazardly and was falling apart.", "date": "2016-10-15 23:02:39"}
{"review_id": "pcHK2OFRRjNQa69KPpH-xQ", "user_id": "bJTKxBIvb_AR8d4SuLPV8g", "business_id": "LixFCMGKdptI8WRsjAl5cQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "This location is small, don't count on a seat. I usually just stop for coffee on my way home, its good. I haven't really stay to observe but it's McDonald's. With that name you should know not to expect quality food but good value\n\nThen again I usually only stop for coffee and muffin at any location\n\nLike most small location that mostly serve for take out, the line are always messy. Not knowing who order and whi is just waiting", "date": "2015-03-08 15:48:32"}
{"review_id": "v6hgUQ8UtKylXWcqnZswQw", "user_id": "x5JmLP79Nm-CReNw6nIP0Q", "business_id": "LixFCMGKdptI8WRsjAl5cQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ordered a lemonade and black ice coffee at drive thru. Not sure if the staff is immature or fed up working today but I found nose mucus (boogers) in my black ice coffee. Perhaps they thought it would be hard to see since its black coffee, but since its in a clear Mccafe cup, it was easy to spot. I'm honestly disgusted. This location is probably the worst in the whole GTA.", "date": "2017-09-01 17:32:51"}
{"review_id": "3WcQOA4LkJPsTBigKHIGkQ", "user_id": "qEVzzrg5tjnmZlYmSFTCSg", "business_id": "LixFCMGKdptI8WRsjAl5cQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Ahhhhh. I'm so ashamed of myself. I love being healthy but once in a while a man has to treat himself to a McFlurry and some nuggets! And a fishwich... Some some friends.. A fountain drink... Pie. \n\nAnyways, this mcdonalds is okay. The workers in the back seem to have fun and the cashiers are always nice. One of them is this super cute girl with too much makeup on. I totally had a James Blunt \"You're beautiful\" moment.... Until my food arrived. Then I had a om nom nom moment. Then... Food coma and regret. \n\nAnyways anyways, decent mcdonalds. No drive through. Some sketchy characters. Give the coffee a chance. \n\nIf you can walk past the curtain of shame and regret, you can have a great cheat meal here.", "date": "2014-05-14 19:04:13"}
{"review_id": "ErB0TOpedmeeHNexbjR9Kw", "user_id": "KBVL9aPlcLVwqyFQ__EeIA", "business_id": "LixFCMGKdptI8WRsjAl5cQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not a big fan of this McDonalds. They can't stick with one structure. It's either two lines or one line. Then there's another line for order pick up which people waiting in line get mixed up in. Part of it is once you walk in it is one aisle the merges directly to the cashier. Messes things up.\n\nThey have recently upgraded their screens so now it's super high tech and very appealing. Only problem with this is now they are showing McDonald's ads which takes the customer away from the actual menu for about 20 seconds. So imagine you get to the cashier and you need to make a decision on your order but have to wait for the ad to go by before you see the menu and then you are limited in time before the ad pops up again. Just not efficient at all.\n\nThey have a separate kids zone which I take advantage of if you want peace and want to avoid the crowd. Yes it's or kids but when kids are in school and you're there during lunch then i'll endure Caillou for 20 mins and eat at peace.\n\nRestaurant is clean and drinks are self serve, which is awesome for refills. Not all locations have implemented this yet.\n\nI would say this place is neutral.. nothing special about it.", "date": "2015-01-27 20:14:04"}
{"review_id": "XQaHy9nU8toeikfBWLd8yQ", "user_id": "xNrEmIeTn7B0eqOccF56jw", "business_id": "LixFCMGKdptI8WRsjAl5cQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This location, just like any other, have renovate into new design, good location, service is good during rush hours, see a employee walk around the lobby to make sure the cleanliness of the restaurant.  Food is not bad, like their Big Breakfast", "date": "2014-10-18 12:00:12"}
{"review_id": "5X1HD8LCsiV2_KPlhyE6JA", "user_id": "HWNMnCJees9B1xAr7wK6GQ", "business_id": "LixFCMGKdptI8WRsjAl5cQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Not here to complain about the Food at McDonald because they are great. However... I went to McDonalds, yesterday and u know the coupons u get from mcdonald. Well, one of them said buy one and get the next one for free. Btw this happened many times to me. I got my self 6 piece mc nuggets for both the free and the one i want to buy and fries, additionally i bought my self a mc double. Stupid me didn't look inside the bag, till i got home. Inside the bag there was one box of mc nuggets with a mc double double. i didn't not get the other box. U might think why cry over not having a box of chicken nuggets that were meant to be free. Well sir or mam, one box feeds a person in the family and since there wasn't another one, another had to stay empty stomach, knowing we aren't rich.", "date": "2016-05-29 16:02:11"}
