{"review_id": "WNnaokUo9-KxrC2ElRakqw", "user_id": "HR7eptealbdyh1FBuaLtLQ", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My roommates and I have three cats and needed to have the carpet cleaned on our rental before we could move. Randy came over on short notice and did an amazing job. He was prompt, pleasant and extremely honest. We had told him to not to worry about the carpeting on the stairs as that was going to be replaced. He said he could try to get the stains out and save us money replacing the carpet. I was willing to have him do that, but then on closer examination, he said that it would be better to replace it, resulting in a lower total for him. A less honest carpet cleaning might not have done that. He also did not try to upsale anything, and before he pretreated the pet stains, he told me how much it would be and allowed me to confirm the new pricing. The end total was affordable and fit the expectations he had set at the beginning, so no surprise fees or charges. The carpets smell and look beautiful. I will recommend him to friends and family and will keep his card should I need his services in the future. I highly recommend Horton Carpet Cleaning, and I'm glad to see that he has such high reviews on Yelp.", "date": "2015-06-08 18:01:45"}
{"review_id": "8irV9AYPvDbZSIdxOZHE_w", "user_id": "JOvW4uod7cxJie0O3Cq1tQ", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My regular carpet cleaner was booked and I needed to have one big room cleaned for a Holiday party on a short notice. (Our little dogs had made a BIG mess in there and the smell was disgusting). Randy not only juggled his schedule to come out the SAME day I called him, but he did an amazing job. He really went above and beyond what I expected and truly saved the day.  My carpet looks great and it really feels and smells clean and like new. I highly recommend him. Courteous, neat, professional and he knows his stuff. Thanks Randy!", "date": "2014-12-17 23:40:07"}
{"review_id": "FwUug4L9PYgrnFM-fyfF0Q", "user_id": "b2NpUbLhPfEoCnv0lM3ZRA", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We are extremely pleased with the service provided by Randy from Horton Carpet Cleaning. He showed up on time, completed a walk-through and was very thorough in the cleaning of the carpets in our condo in Chandler. He checked for pet damage with a black light and then pre-treated those spots. I think he was here about 2 hours and we are very happy with how clean and fresh our carpets are now. Randy is a very personable, nice guy and we will have him back without question when we need carpets, upholstery or tile cleaned. Thanks Randy for your excellent service!", "date": "2015-11-19 17:36:55"}
{"review_id": "a7WGV4dO9-6LiXQXvdteRQ", "user_id": "Dgs6xw52yiYNCInfC-Hwww", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Used Randy of Horton Carpet Cleaning today on recommendation from Bradley Carpet Cleaners.. If I could give him more than 5 stars I would!\nMy tile floors now look like they were just installed, and bedroom carpets are like new! Even the pile is up like newly installed carpet!! They`re absolutely Amazing!\nHe arrived exactly the time he said he would also.\nHIGHLY recommend!", "date": "2017-04-19 23:46:55"}
{"review_id": "zt_1ANi_xf9aSLeUt0-1xA", "user_id": "yA12PRMaFUtweoVjYtlHOw", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 4, "funny": 0, "cool": 0, "text": "My fiancé spilled dark blue paint on our light brown carpets. Randy and his son came out the same day and cleaned the hell out of the stain, and the rest of our carpets. Very friendly, good prices. I highly recommend!", "date": "2014-09-12 23:07:40"}
{"review_id": "Vt8goy-7dm_D3fIus8UYeg", "user_id": "yjyd07UenA1IqAQwJEqwIQ", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Randy cleaned my carpets at my house and WOW!! What an awesome job, I will not recommend people or companies that I have not done business with and that been said....I DEFINITELY recommend Horton Carpet Cleaning!! Two Thumbs up!!", "date": "2015-07-06 16:02:21"}
{"review_id": "rpbqMA3QK2tCumuBqHeeBg", "user_id": "asS0HT2cFfL2gLo9OGLeKA", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Horton Carpet Cleaning is in a class of their own. We had Randy back out to our home recently to clean carpets, and once again he did an outstanding job. The work is methodical and detailed-paying close attention to every aspect of the job, and is only surpassed by how caring and professional his work ethic. Before we met Randy, we tried many of the big name companies and a few smaller ones, but no one has matched Horton's value and quality. \n\nOh, and just so people know, Randy has a legit water softener/treatment unit as part of his system. This means no hard water, sediment or chlorine going into our carpets and flooring! The result are deep cleaned, soft carpets which smell clean and fresh!\n\nHorton Carpet Cleaning will continue to be our go-to expert in carpet and flooring care. BIG thanks, Randy\n\nDave & Gloria\nChandler, AZ", "date": "2017-07-21 15:28:28"}
{"review_id": "XPaVK8T5JfxMHsyw1lHVRw", "user_id": "Z1mLrweFRoiGqqXvpgyi5Q", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Randy was right on time and did the best job ever.  My carpeting hasn't looked this clean in years.", "date": "2015-10-11 15:58:03"}
{"review_id": "hE-_wY1Fa59GozJhWj16LA", "user_id": "3S9Fb8JnXYMBOhGDnJC2RQ", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Super experience with Randy from Horton Carpet Cleaning.  Arranged to meet him at a rental house I manage for a carpet cleaning appointment.  When we arrived we found that the electricity had been turned off.  Randy waited while I found out from the electric company that there was an outage in the neighborhood.  He waited with me a good long time before we decided to try again for the next day.  The following day, Randy showed up, on time, did a fantastic job on the carpets, and I was able to charge it to my miles credit card (which is always a bonus!)  Horton Carpet Cleaning will have my future business!", "date": "2015-07-19 16:57:32"}
{"review_id": "jpnY_Or_gzj_7HMR2MF7Dg", "user_id": "Xdm1eRh_KQfsDAjL5iOLMA", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I had a great experience using Horton Carpet Cleaning!  Randy, the owner, arrived right on time and was courteous and friendly throughout the time he was at my house.  He was able to get stains out of the carpet and none of them have resurfaced since he left.  Randy spent a lot of time at my house and did a thorough cleaning job.  I also appreciated that Randy quoted me a price before he got to my house and then LOWERED the price after measuring the rooms and seeing how much carpet he actually would be cleaning.  Randy was honest, friendly, thorough and did a great job!  My carpets look absolutely fantastic!!!", "date": "2018-07-11 01:24:30"}
{"review_id": "1RfZy2ntFj8w9LU5WYm26Q", "user_id": "84s7oiK1LoIrkDkQWCtGlQ", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We've all grown to hate carpet because it is so unpleasant when it gets dirty from everyday use.  But RANDY HORTON works magic on making carpet look like it has been freshly installed.  He also doesn't rush the job and is most knowledgeable about his profession and has great customer service skills.  I just want to hug my carpets and my carpet man.  I definitely will be calling him again and even more frequently now that I know the impossible can be done to keep my carpets looking like new.  Thank you RANDY.", "date": "2017-06-22 02:43:44"}
{"review_id": "eHVDLYG8A9EM7T5GrJ2hNQ", "user_id": "J_YvuhImu-IabKXmwFsWDA", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Randy showed up exactly on time. He told me exactly how much it would cost. He did an amazing job. Our carpets look brand new!  During the process one of his hoses leaked onto our wood flooring, no big deal but he insisted on discounting his original estimate. This guy is a pro and I would recommend him to anyone and everyone!", "date": "2018-05-21 18:07:39"}
{"review_id": "q-4n7obrhpB68klbiXUG3Q", "user_id": "slRzZ0g3B6fs6IcKv7VhMA", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Highly recommended. Made our carpet look brand new, and that is no exaggeration.  On top of that scheduling with Randy was a breeze. Will definitely use again in the future!\n-Paul & Monica", "date": "2016-01-24 18:16:06"}
{"review_id": "HafcBlBpCyOmtRCxb8mHtQ", "user_id": "5JAYsWBnv24L7J7Vh0VHnQ", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "10/10 very professional, great service. Randy did a fantastic job getting out dirt and debris that i thought would never come out of my carpet! Couldn't be more happy with how it turned out. I highly recommend Horton Carpet Cleaning. I will definitely be using Horton Carpet Cleaning for all of my future needs. Thank you so much Randy for making my carpet beautiful again! \n\n\n- Laura Bacino\nChandler, Arizona", "date": "2018-07-31 03:22:51"}
{"review_id": "PLFrFZurBrNRWfSJaCBhRw", "user_id": "asS0HT2cFfL2gLo9OGLeKA", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Horton Carpet Cleaning is in a class of their own. We had Randy back out to our home recently to clean carpets, and once again he did an outstanding job. The work is methodical and detailed-paying close attention to every aspect of the job, and is only surpassed by how caring and professional his work ethic. Before we met Randy, we tried many of the big name companies and a few smaller ones, but no one has matched Horton's value and quality. \n\nOh, and just so people know, Randy has a legit water softener/treatment unit as part of his system. This means no hard water, sediment or chlorine going into our carpets and flooring! The result are deep cleaned, soft carpets which smell clean and fresh!\n\nHorton Carpet Cleaning will continue to be our go-to expert in carpet and flooring care. BIG thanks, Randy\n\nDave & Gloria\nChandler, AZ", "date": "2017-07-25 03:03:01"}
{"review_id": "o9Jz_V28YUnni_Fph7NW3w", "user_id": "KpgY70ENZ298nhjnuTasOA", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Stop searching. This is the guy you want. I have 3 kids, and a dog. I've used different cleaners over the years, and I've experienced different levels of quality. Randy with Horton is at the top of the class, and presumably the greater Phoenix area. Everything went smooth. He arrived promptly on time, thoroughly answered my many questions, and took his time fixing the disaster I handed to him. \n\nJust make sure you set aside some extra time, because he doesn't seem to care how long it takes to do the best he can. 900+ sq feet took nearly 4 hours. It looks soooo much better.", "date": "2018-10-20 21:10:27"}
{"review_id": "g5W7z2QQW5SWZlKuj08i-A", "user_id": "k4Spdotc1oCINmkKLS6JnQ", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "We hired Randy to get the carpet and grout cleaning in our house.He came over on a very short notice and was very friendly and helpful. We called his previous employer, who was busy and referred him to us and we are glad we got the carpet and floor cleaned by him. He is very patient, reasonable and knowledgeable. Not too expensive. \nIf you are first time home buyer, you can try this guy and you wont regret it.", "date": "2015-01-02 22:21:51"}
{"review_id": "ZNIBwlzIm-b7zXG3L9Dkeg", "user_id": "5FhWG7kBlVQEI7ryigd8lg", "business_id": "064fFc4CdNxAJJDVR-7FSQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Randy is extremely kind, patient and honest.  He did everything he said he would and didn't try throwing in some extra fees at the end that were not previously discussed.  He cleaned our floors wonderfully and I would absolutely recommend him to friends and family!", "date": "2014-11-26 22:39:49"}
